// TODO: 증권사 ID 정해지면 name -> id 로 변경
const bankMap = new Map([
  ["KB증권", ["신한 쏠", "카카오뱅크", "국민은행"]],
  ["키움증권", []],
  ["유안타증권", ["우리은행"]],
  ["대신증권", ["신한 쏠", "우리은행"]],
  ["미래에셋증권", ["신한 쏠", "카카오뱅크", "토스"]],
  ["삼성증권", []],
  ["한국투자증권", ["신한 쏠", "카카오뱅크", "토스"]],
  ["신한투자증권", ["신한 쏠", "카카오뱅크"]],
  ["NH투자증권", ["카카오뱅크", "토스"]],
  ["SK증권", ["토스"]],
  ["한화투자증권", []],
  ["하나증권", ["신한 쏠", "카카오뱅크"]],
  ["유진투자증권", []],
  ["IBK투자증권", ["IBK기업은행"]],
  ["교보증권", ["신한 쏠"]],
  ["하이투자증권", []],
  ["다올투자증권", ["신한 쏠"]],
  ["현대차증권", ["신한 쏠"]],
  ["신영증권", []],
  ["DB금융투자증권", ["IBK기업은행"]],
  ["부국증권", []],
  ["이프투자증권", []],
  ["상상인증권", []],
]);

const getRelatedBankList = (name: string) => {
  return bankMap.get(name) ?? [];
};

export default getRelatedBankList;
